Rrodriguez-microchip/PIC18F56Q71-CURIOSITY-RGB-LED/RGB_PIC18F.X/RGB_LED.h
/* Microchip Technology Inc. and its subsidiaries.  You may use this software 
 * and any derivatives exclusively with Microchip products. 
 * 
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS".  NO WARRANTIES, WHETHER 
 * EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED 
 * WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A 
 * PARTICULAR PURPOSE, OR ITS INTERACTION WITH MICROCHIP PRODUCTS, COMBINATION 
 * WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION. 
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
 * INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND 
 * WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS 
 * BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE 
 * FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS 
 * IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF 
 * ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE 
 * TERMS. 
 */

/* 
 * File:   
 * Author: 
 * Comments:
 * Revision history: 
 */

// This is a guard condition so that contents of this file are not included
// more than once.  
#ifndef XC_HEADER_TEMPLATE_H
#define	XC_HEADER_TEMPLATE_H

#include <xc.h> 
#include "mcc_generated_files/system/system.h"

// Color definitions (0-65535 for 16-bit PWM)
#define PWM_MAX 64511
#define PWM_OFF 0

// Predefined colors
#define RED_COLOR       PWM_MAX, PWM_OFF, PWM_OFF
#define GREEN_COLOR     PWM_OFF, PWM_MAX, PWM_OFF
#define BLUE_COLOR      PWM_OFF, PWM_OFF, PWM_MAX
#define WHITE_COLOR     PWM_MAX, PWM_MAX, PWM_MAX
#define YELLOW_COLOR    PWM_MAX, PWM_MAX, PWM_OFF
#define CYAN_COLOR      PWM_OFF, PWM_MAX, PWM_MAX
#define MAGENTA_COLOR   PWM_MAX, PWM_OFF, PWM_MAX
#define OFF_COLOR       PWM_OFF, PWM_OFF, PWM_OFF

#ifdef	__cplusplus
extern "C" {
#endif /* __cplusplus */

    // TODO If C++ is being used, regular C code needs function names to have C 
    // linkage so the functions can be used by the c code. 

#ifdef	__cplusplus
}
#endif /* __cplusplus */

#endif	/* XC_HEADER_TEMPLATE_H */
void Load_bufferRegisters(void);
void setRGB(uint16_t red, uint16_t green, uint16_t blue);
void rgbTest1 (void);
void rgbTest (void);
void colorCycle(void);
void breathingEffect(void);
void rainbowCycle(void);
